data/Borelog_Request_SOAP.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope"
    xmlns:a="http://www.w3.org/2005/08/addressing">
    <s:Header>
        <a:Action s:mustUnderstand="1">https://wsterraindex.terraindex.com/ITWorks.TerraIndex/IITWBoreprofileService_V1_0/GetBoreprofile_V1_0</a:Action>
        <a:MessageID>urn:uuid:043d050d-c261-442b-8057-272a49d349b9</a:MessageID>
        <a:ReplyTo>
            <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
        </a:ReplyTo>
        <a:To s:mustUnderstand="1">https://test.terraindex.com/DataWSExternals/ITWBoreprofileService_V1_0.svc</a:To>
    </s:Header>
    <s:Body>
        <GetBoreprofile_V1_0 xmlns="https://wsterraindex.terraindex.com/ITWorks.TerraIndex/">
            <request xmlns:b="http://schemas.datacontract.org/2004/07/ITWorks.BusinessEntities.Boreprofile"
                xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
                <b:AuthorisationRequest xmlns:c="http://schemas.datacontract.org/2004/07/ITWorks.BusinessEntities.Authorisation">
                    <c:ApplicationCode>{applicationcode}</c:ApplicationCode>
                    <c:FeatureWord>0</c:FeatureWord>
                    <c:Licensenumber>{licensenumber}</c:Licensenumber>
                    <c:Username>{username}</c:Username>
                </b:AuthorisationRequest>
                <b:BorelogParameters>
                    <b:Boreholes>
                    </b:Boreholes>
                    <b:DrawKind>BoreHole</b:DrawKind>
                    <b:DrawMode>Single</b:DrawMode>
                    <b:ForceCaching>false</b:ForceCaching>
                    <b:Language>NL</b:Language>
                    <b:Layout></b:Layout>
                    <b:LayoutName>hjkh</b:LayoutName>
                    <b:LayoutDirectory i:nil="true"/>
                    <b:LayoutGefCpt i:nil="true"/>
                    <b:OutputType>PNG</b:OutputType>
                    <b:PageNumber>1</b:PageNumber>
                    <b:TempDirectory i:nil="true"/>
                    <b:TestingTables i:nil="true"/>
                    <b:UserDataDirectory i:nil="true"/>
                </b:BorelogParameters>
                <b:WebserviceSession i:nil="true"/>
                <b:WebserviceVersion>1.0</b:WebserviceVersion>
            </request>
        </GetBoreprofile_V1_0>
    </s:Body>
</s:Envelope>